Tekla Open API Reference for Tekla Structures 2025
PourBreakAttributes Properties
The PourBreak.PourBreakAttributes type exposes the following members.
Properties
Name | Description
DrawHiddenLines
 Indicates whether hidden lines are used to draw the pour break or not.
HiddenLines
 The hidden line type of the pour break.
VisibleLines
 The visible line type of the pour break.
Top
See Also
Reference
PourBreak.PourBreakAttributes Class
Tekla.Structures.Drawing Namespace